{
  "librosLotr": [
    {
    "id": "b1eh",
    "nombre": 'El Hobbit(The Hobbit)',
    publicacion: 1937,
    paginas: 288,
    introduccion: 'El hobbit (título original en inglés: The Hobbit, or There and Back Again, usualmente abreviado como The Hobbit) es una novela fantástica del filólogo y escritor británico J. R. R. Tolkien. Fue escrita por partes desde finales de los años 1920 hasta principios de los años 1930 y, en un principio, tan solo tenía el objetivo de divertir a los hijos pequeños de Tolkien.1​ No obstante, el manuscrito de la obra aún sin acabar fue prestado por el escritor a varias personas y finalmente acabó en manos de la editorial George Allen & Unwin. Dispuestos a publicarla, los editores pidieron a Tolkien que finalizara la obra y El hobbit fue publicada el 21 de septiembre de 1937 en el Reino Unido. Es la primera obra que explora el universo mitológico creado por Tolkien y que más tarde se encargarían de definir El Señor de los Anillos y El Silmarillion. Dentro de dicha ficción, el argumento de El hobbit se sitúa en el año 2941 de la Tercera Edad del Sol,2​ y narra la historia del hobbit Bilbo Bolsón, que junto con el mago Gandalf y un grupo de enanos, vive una aventura en busca del tesoro custodiado por el dragón Smaug en la Montaña Solitaria. Debido al éxito que tuvo y a las buenas críticas que recibió, los editores pidieron a Tolkien una continuación. Bautizada como El Señor de los Anillos, su cambio a un tono alejado del infantil provocó que El hobbit tuviera que ser modificado ligeramente para que ambas historias coincidieran mejor.3​ Tras la publicación en 1964 de la edición argentina titulada El hobito,4​ Ediciones Minotauro compró los derechos de las obras de Tolkien y publicó una traducción mejorada de la novela en España en 1982 y en Argentina en 1984.5​6​ La BBC Radio 4 realizó una adaptación radiofónica de El hobbit en 1968,7​ mientras que Arthur Rankin Jr. y Jules Bass produjeron una película sobre ella para la televisión.8​ En la actualidad ha finalizado la producción de una trilogía basada en El Señor de los Anillos producida por el director Peter Jackson.9​ A pesar de haberse involucrado por más de dos años en el diseño y producción de las adaptaciones al cine,10​ el 31 de mayo de 2010, el mexicano Guillermo del Toro renunció a la dirección de las cintas debido al retraso en el comienzo de la filmación por los problemas financieros que atraviesa la productora Metro-Goldwyn-Mayer.11​ En diciembre de 2012 se estrenó la primera parte, Un viaje inesperado, en 2013 se estrenó La desolación de Smaug, mientras que el estreno de la última película, La batalla de los Cinco Ejércitos, se realizó en diciembre de 2014. 12​ También se han creado varios videojuegos basados en la novela.',
    portada: 'app/res/img/libro_elHobbit.jpg',
  },
  {
    id: 'b2lcda',
    nombre: 'La Comunidad del Anillo (The Fellowship of the Ring)',
    publicacion: 1954,
    paginas: 423,
    introduccion: 'La Comunidad del Anillo (título original en inglés: The Fellowship of the Ring) es el primero de los tres volúmenes que forman la novela El Señor de los Anillos, secuela de El hobbit, del escritor británico J. R. R. Tolkien. La obra fue escrita para ser publicada en un solo tomo, pero debido a su longitud y coste, la editorial Allen & Unwin decidió dividirla.4​ Fue publicada el 29 de julio de 1954, año en el cual se publicó también la segunda parte, Las dos torres, y recibió críticas variadas aunque bastante mejores de las que esperaba el propio autor.5​ Está dividida a su vez en dos más, los libros I y II, precedidas de un prólogo y de un escrito titulado Nota sobre los archivos de la Comarca, que no apareció hasta la segunda edición de La Comunidad del Anillo.6​ En este último, Tolkien enumera las fuentes usadas a la hora de escribir el libro, ya que pretende dar a entender que la historia ocurrió en realidad.7​',
    portada: 'app/res/img/libro_laComunidadDelAnillo.jpg',
  },
  {
    id: 'b3l2t',
    nombre: 'Las dos torres (The Two Towers)',
    publicacion: 1954,
    paginas: 352,
    introduccion: 'Las dos torres (titulado originalmente en inglés: The Two Towers) es el segundo volumen de la novela de fantasía heroica El Señor de los Anillos, del escritor británico J. R. R. Tolkien. La Comunidad del Anillo precede a este volumen, y a su vez continúa en El retorno del Rey. La versión original en inglés fue publicada en 1954; y su traducción al español fue llevada a cabo por Matilde Horne2​ y Luis Domènech3​4​ para Ediciones Minotauro5​ y finalmente publicada en noviembre de 1979.6​ La historia transcurre dentro del universo ficticio de la Tierra Media, y en ella se continúa la narración de las aventuras de los protagonistas de La Comunidad del Anillo: la muerte de Boromir, el secuestro de Merry y Pippin por los orcos de Saruman y su posterior huida, las batallas de Aragorn, Legolas y Gimli en el Oeste en contra de los ejércitos del señor oscuro y el viaje de Frodo y Sam hacia el Este, cruzando las tierras controladas por el enemigo para llegar al Monte del Destino y destruir el Anillo Único.',
    portada: 'app/res/img/libro_lasDosTorres.jpg',
  },
  {
    id: 'b4erdr',
    nombre: 'El retorno del Rey (The Return of the King)',
    publicacion: 1955,
    paginas: 413,
    introduccion: 'El retorno del Rey (titulado originalmente en inglés: The Return of the King) es el tercer volumen de la novela de fantasía heroica El Señor de los Anillos, del escritor británico J. R. R. Tolkien. Las dos torres es el volumen inmediatamente anterior a este volumen, y el primero de la serie es La Comunidad del Anillo. La versión original en inglés fue publicada en 1955; y su traducción al español fue llevada a cabo por Matilde Horne2​ y Luis Domènech3​4​ para Ediciones Minotauro5​ y finalmente publicada en noviembre de 1980.6​',
    portada: 'app/res/img/libro_elRetornoDelRey.jpg',
  },
  {
    id: 'b5es',
    nombre: 'El Silmarillion',
    publicacion: 1977,
    paginas: 494,
    introduccion: 'El Silmarillion es una recopilación de obras de J. R. R. Tolkien, editada y publicada póstumamente por su hijo Christopher Tolkien, en 1977. En ella, se narra, entre otras cosas, la creación de Eä y el nacimiento de las razas más importantes (Valar, Maiar, elfos, hombres y enanos) de la Tierra Media. La mayor porción de El Silmarillion, titulada «Quenta Silmarillion» trata sobre los Silmaril, joyas hechas por Fëanor en Aman y alrededor de las cuales se entreteje la historia de la Primera Edad del Sol en la Tierra Media, principalmente en la región conocida como Beleriand. También se incluyen otras historias más breves: «Ainulindalë», «Valaquenta» y «Akallabêth». Una última historia («De los Anillos de Poder y la Tercera Edad») sirve como marco de referencia histórico para El hobbit y El Señor de los Anillos, las más conocidas novelas de Tolkien.',
    portada: 'app/res/img/libro_elSilmarillion.jpg',
  },
];
  "profile": {
    "name": "typicode"
  }
}
